# -*- coding: utf-8 -*-
#Задача 2
a = int(input("Введите первый катет:"))
b = int(input("Введите второй катет:"))
print("Площадь треугольника =", (a*b)/2)

